Revit 2026 API

# ExternalGeometryIdIsValidExternalGeometryId Method

---

Checks whether a given string represents a valid ExternalGeometryId or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidExternalGeometryId(
	string externalGeometryId
)
```
```vb
Public Shared Function IsValidExternalGeometryId (
	externalGeometryId As String
) As Boolean
```
```cpp
public:
static bool IsValidExternalGeometryId(
	String^ externalGeometryId
)
```
```fsharp
static member IsValidExternalGeometryId :
        externalGeometryId : string -> bool
```

#### Parameters

externalGeometryId String
     A string that represents an identifier for an external geometry.

#### Return Value

Boolean True if the string represents a valid ExternalGeometryId, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Any non-empty string is a valid ExternalGeometryId.

#### Reference

ExternalGeometryId Class

Autodesk.Revit.DB Namespace